Revit 2026 API

# SpaceBaseOffset Property

---

Get or set the Base Offset of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double BaseOffset { get; set; }
```
```vb
Public Property BaseOffset As Double
	Get
	Set
```
```cpp
public:
property double BaseOffset {
	double get ();
	void set (double value);
}
```
```fsharp
member BaseOffset : float with get, set
```

#### Property Value

Double

This property is used to get or set the Base Offset of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace